Revit 2027 API
DividedPath.SpacingRuleLayout Property
 The layout determines how points are distributed along the path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpacingRuleLayout SpacingRuleLayout { get; set; }
Public Property SpacingRuleLayout As SpacingRuleLayout
	Get
	Set
public:
property SpacingRuleLayout SpacingRuleLayout {
	SpacingRuleLayout get ();
	void set (SpacingRuleLayout value);
}
member SpacingRuleLayout : SpacingRuleLayout with get, set
Property Value
SpacingRuleLayout
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: Invalid layout -or- When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DividedPath Class
Autodesk.Revit.DB Namespace